---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.IsMonolithic
source: html/e221f2fe-930c-3a7b-c731-6c1838f2d979.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.IsMonolithic Property

True if the stairs run is monolithic, false otherwise.

## Syntax (C#)
```csharp
public bool IsMonolithic { get; }
```